# Mozilla CA certificate store
brew "ca-certificates"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Load/unload environment variables based on $PWD
brew "direnv"
# Command-line tool for DigitalOcean
brew "doctl"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Package manager for the Lua programming language
brew "luarocks"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Python 2 and 3 compatibility utilities
brew "six"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# High-performance theorem prover
brew "z3"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# Flux CLI
brew "fluxcd/tap/flux"
# Terraform
brew "hashicorp/tap/terraform"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "siderolabs/tap/talosctl"
# Eclipse-based LDAP browser and directory client
cask "apache-directory-studio"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source media player
cask "iina"
# JDK from Oracle
cask "oracle-jdk"
# Replacement for Docker Desktop
cask "orbstack"
# Control your tools with a few keystrokes
cask "raycast"
# Open-source code editor
cask visual-studio-code
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "golang.go"
vscode "gp-pereira.refatorex"
vscode "hashicorp.terraform"
vscode "jakebecker.elixir-ls"
vscode "lamarcke.kanagawa-black"
vscode "mrorz.language-gettext"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "otovo-oss.htmx-tags"
vscode "oven.bun-vscode"
vscode "philsinatra.popping-and-locking-vscode-black"
vscode "phoenixframework.phoenix"
vscode "qufiwefefwoyn.kanagawa"
vscode "qwtel.sqlite-viewer"
vscode "rust-lang.rust-analyzer"
vscode "sst-dev.opencode"
vscode "subframe7536.custom-ui-style"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "ziglang.vscode-zig"
